# First step

## Glasgow Haskell Compiler

- A state-of-the-art, open source implementation of Haskell
- The system has two main components: a batch compiler called GHC, and an interactive interpreter called GHCi

## Standard prelude

- Haskell comes with a large number of built-in functions, which are defined in a library file called the standard prelude
- Example of prelude function on lists

```haskell
-- select the first element of a non-empty list:
> head [1,2,3,4,5]
1
-- Remove the first element from a non-empty list:
> tail [1,2,3,4,5]
[2,3,4,5]
-- Select the nth element of list (counting from zero):
> [1,2,3,4,5] !! 2
3
-- Select the first n elements of a list:
> take 3 [1,2,3,4,5]
[1,2,3]
-- Remove the first n elements from a list:
> drop 3 [1,2,3,4,5]
[4,5]
-- length of a list:
> length [1,2,3,4,5]
5
-- Calculate the sum of a list of numbers:
> sum [1,2,3,4,5]
5
-- Calculate the product of a list of numbers:
> product [1,2,3,4,5]
120
-- Append two lists:
> [1,2,3] ++ [4,5]
[1,2,3,4,5]
-- Reverse a list
> reverse [1,2,3,4,5]
[5,4,3,2,1]
```

## Function application

- Function application in Haskell is denoted silently using spacing, while the multiplication of two values is denoted explicitly using the operator `*`.
  - Math equation: `f(a, b) + cd` will be like `f a b + c*d ` in Haskell
- Function application has higher priority than all other operators in the language
  -  `f a + b` means `(f a) + b` rather than `f(a + b)`

| mathematics | Haskell |
|--|--|
|f(x) | f x |
|f(x, y) | f x y |
|f(g(x)) | f (g x) |
|f(x, g(y)) | f x (g y)|
|f(x)g(y) | f x * g y |

## Running script with ghci

```bash
ghci test.hs # Now both the standard prelude
             # from both can be freely used.

# edit test.hs and save, you need to reload for ghci to know
> :reload
```

## Side note on single back quote

- In general, any function with two arguments can be written between its arguments by enclosing the name of the function in single back quotes `\``

```haskell
average ns = sum ns `div` length ns

-- equivalent to

average ns = div (sum ns) (length ns)
```

## Naming requirements

- The names of the function and its arguments must begin with a lower-case letter, but can then be followed by zero or more letters (both lower- and upper-case), digits, underscores, and forward single quotes
- The following list of keywords have a special meaning in the language, and cannot be used as the names of functions or their arguments:

```haskell
case
class
data
default
deriving
do
else
foreign
if
import
in
infix
infixl
infixr
instance
let
module
newtype
of
then
type
where
```

- By convention, list arguments in Haskell usually have the suffix s on their name to indicate that they may contain multiple values. For example,
  - a list of numbers might be named `ns`,
  - a list of arbitrary values might be named `xs`, and
  - a list of lists of characters might be named `css`

## The layout rule

- Within a script, each definition at the same level **must** begin in precisely the same column.
- This layout rule makes it possible to determine the grouping of definitions from their indentation.

```haskell
a = b + c
    where
        b = 1
        c = 2
d = a * 2
```

- It is clear from the indentation that b and c are local definitions for use within the body of a.
- If desired, such grouping can be made explicit by enclosing a sequence of definitions in curly parentheses and separating each definition by a semi-colon.

```haskell
a = b + c
    where
        {b = 1;
         c = 2};
d = a * 2
```

- or even with single line:

```haskell
a = b + c where {b = 1; c = 2}; d = a * 2
```

- In general, however, **it is usually preferable to rely on the layout rule to determine the grouping of definitions**, rather than using explicit syntax.

## Comments

- Ordinary comments begin with the symbol `--` and extend to the end of the current line
- Nested comments begin and end with the symbols `{-` and `-}`, may span multiple lines, and may be nested in the sense that comments can contain other comments.
